# GetSimilarTypes Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementType..::..GetSimilarTypes Method
ElementType Class See Also
---
Obtains a set of types that are similar to this type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetSimilarTypes()
```

Visual Basic
---
```text
Public Function GetSimilarTypes As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetSimilarTypes()
```

# ### Return Value
A set of element IDs of types that are similar to this type.
# Remarks
Two types are similar if elements that have one type could be assigned the other type.
# See Also
ElementType Class
Autodesk.Revit.DB Namespace